//TECN258A JOB NOTIFY=&SYSUID
//STEP1 EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN DD *
  BLDINDEX -
  INDATASET(TECN258.TRAIN.DETAILS.KSDS) -
  OUTDATASET(TECN258.TRAIN.DETAILS.AIX)
/*
