//JCLEX08  JOB NOTIFY=&SYSUID
//STEP1    EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//FILE     DD DSN=JCLEX08.EMPLOY.DETAILS.PS1,DISP=SHR
//SYSIN    DD *
  PRINT INFILE(FILE) -
  CHAR
/*
