//TECN258A JOB NOTIFY=&SYSUID
//STEP1 EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN DD *
  DEFINE PATH(NAME(TECN258.TRAIN.DETAILS.KSDSAIX) -
         PATHENTRY(TECN258.TRAIN.DETAILS.AIX) -
         UPDATE
/*
