//USER_IDA JOB NOTIFY=&SYSUID
//STEP1 EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN DD *
  DEFINE PATH(NAME(USER_ID.TRAIN.DETAILS.KSDSAIX) -
         PATHENTRY(USER_ID.TRAIN.DETAILS.AIX) -
         UPDATE
/*
