//TECN258$ JOB NOTIFY=&SYSUID
//JOBLIB   DD DSN=TECN258.MYLIB.COBOL.LOADLIB,DISP=SHR
//STEP1    EXEC PGM=CC01CB01
//INPRDS   DD DSN=TECN258.MYDATA.CC01.PS1,DISP=SHR
//OUTPRDS  DD DSN=TECN258.MYDATA.CC01.PS2,
//            DISP=(NEW,CATLG,DELETE),
//            LIKE=TECN258.MYDATA.CC01.PS1