  SORT FIELDS=(1,5,CH,A)                                                00010000
  OMIT COND=(1,5,CH,EQ,C' ')                                            00020000
