//USER_IDA  JOB NOTIFY=&SYSUID
//STEP1 EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//BACKUP   DD DSN=USER_ID.TRAIN.DETAILS.KSDSBKP,DISP=SHR
//SYSIN    DD *                                        
     IMPORT                                 -
     INFILE(BACKUP)                         -
     OUTDATASET(USER_ID.TRAIN.DETAILS.KSDS) -
     INTOEMPTY
/*
