//TECN258A  JOB NOTIFY=&SYSUID
//STEP1     EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN DD *
  LISTCAT ENT('TECN258.POLICY.RRDS') ALL
/*
