//USER_IDA  JOB NOTIFY=&SYSUID
//STEP1     EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN DD *
  LISTCAT ENT('USER_ID.TRAIN.DETAILS.KSDS') ALL
/*
