  SORT FIELDS=COPY                                                      00010000
  OUTREC OVERLAY=(7:7,3,ZD,ADD,+50,TO=ZD,LENGTH=3)                      00020001
