//USER_IDA JOB NOTIFY=&SYSUID  
//RUN EXEC PGM=COBEX06                  
//STEPLIB DD DSN=USER_ID.MYLIB.LOADLIB,DISP=SHR  
//SYSPRINT DD SYSOUT=*      
//SYSIN DD DUMMY