//USER_IDR JOB NOTIFY=&SYSUID                   
//RUN EXEC PGM=COBEX06                          
//STEPLIB DD DSN=USER_ID.MYLIB.LOADLIB,DISP=SHR 
//SYSPRINT DD SYSOUT=*                          
//SYSIN DD *
5000000
1000000
0550000
0500000
0300000
0500000
0100000
/*