//JCLEX10  JOB (JCLEX10),'DIV',CLASS=A,
//         MSGCLASS=A,MSGLEVEL=(1,1),NOTIFY=&SYSUID
//STEP1    EXEC PGM=IEFBR14
//DD0      DD DSN=&&TEMP,
//            DISP=(NEW,PASS),
//            SPACE=(TRK,(1,1)),
//            DCB=(LRECL=80,RECFM=FB)
//STEP2    EXEC PGM=IEFBR14
//DD1      DD DSN=&&TEMP,
//            DISP=(OLD,DELETE)
