   DEFINE CLUSTER(NAME(USER_ID.VSAM.CC01.KSDS) -
   KEYS(5,0) -
   TRACKS(1,1) -
   VOLUMES(ZAPRD4) -
   RECORDSIZE(80,80) -
   CISZ(4096) -
   INDEXED -
   FREESPACE(10,10))
