//USER_IDA  JOB NOTIFY=&SYSUID
//STEP1 EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//BACKUP   DD DSN=USER_ID.PRODUCT.ESDS.BCKUP,
//            DISP=(NEW,CATLG,DELETE),
//            LIKE=USER_ID.PRODUCT.ESDS
//SYSIN DD *
  EXPORT -
  USER_ID.PRODUCT.ESDS -
  OUTFILE(BACKUP) -
  TEMPORARY
/*
//STEP2 EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN DD *
  DELETE 'USER_ID.PRODUCT.ESDS'
/*
