//TECN258A  JOB NOTIFY=&SYSUID
//STEP1 EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//BACKUP   DD DSN=TECN258.PRODUCT.ESDS.BCKUP,
//            DISP=(NEW,CATLG,DELETE),
//            LIKE=TECN258.PRODUCT.ESDS
//SYSIN DD *
  EXPORT -
  TECN258.PRODUCT.ESDS -
  OUTFILE(BACKUP) -
  TEMPORARY
/*
//STEP2 EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN DD *
  DELETE 'TECN258.PRODUCT.ESDS'
/*
