//USER_IDA JOB NOTIFY=&SYSUID
//STEP1 EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN DD *
  BLDINDEX -
  INDATASET(USER_ID.PRODUCT.ESDS) -
  OUTDATASET(USER_ID.PRODUCT.AIX)
/*
