//TECN258A JOB NOTIFY=&SYSUID
//STEP1 EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN DD *
  BLDINDEX -
  INDATASET(TECN258.PRODUCT.ESDS) -
  OUTDATASET(TECN258.PRODUCT.AIX)
/*
