//USER_IDA JOB NOTIFY=&SYSUID
//         JCLLIB ORDER=USER_ID.MYPROC.JCL
//STEP1 EXEC PROC=DSCOPY,INP=USER_ID.MYLIB.JCL1,
//           OUT=USER_ID.MYSAMP.PDS1
//SYSPRINT DD SYSOUT=*
//SYSIN DD *
    COPY INDD=DDIN,OUTDD=DDOUT
    SELECT MEMBER=(JCLEX01,JCLEX02)
//STEP2 EXEC PROC=DSCOPY,INP=USER_ID.MYLIB.JCL1,
//           OUT=USER_ID.MYSAMP.PDS2
//SYSPRINT DD SYSOUT=*
//SYSIN DD *
    COPY INDD=DDIN,OUTDD=DDOUT
    EXCLUDE MEMBER=(JCLEX01,JCLEX02)
/*
