//TECN252A JOB NOTIFY=&SYSUID
//         JCLLIB ORDER=TECN252.MYPROC.JCL
//STEP1 EXEC PROC=DSCOPY,INP=TECN252.MYLIB.JCL1,
//           OUT=TECN252.MYSAMP.PDS1
//SYSPRINT DD SYSOUT=*
//SYSIN DD *
    COPY INDD=DDIN,OUTDD=DDOUT
    SELECT MEMBER=(JCLEX01,JCLEX02)
//STEP2 EXEC PROC=DSCOPY,INP=TECN252.MYLIB.JCL1,
//           OUT=TECN252.MYSAMP.PDS2
//SYSPRINT DD SYSOUT=*
//SYSIN DD *
    COPY INDD=DDIN,OUTDD=DDOUT
    EXCLUDE MEMBER=(JCLEX01,JCLEX02)
/*
