//JCLEX03  JOB (JCLEX03),'DEV',NOTIFY=&SYSUID
//STEP2    EXEC PGM=IEBGENER
//SYSPRINT DD  SYSOUT=*
//SYSUT1   DD  DSN=JCLEX03.EMPDET.COPY.PS1,DISP=SHR
//         DD  DSN=JCLEX03.MYDATA.PS1,DISP=SHR
//SYSUT2   DD  DSN=JCLEX03.EMPDET.ALL.PS1,
//         SPACE=(TRK,(1,1)),
//         DISP=(NEW,CATLG,DELETE),
//         DCB=(RECFM=FB,LRECL=80,DSORG=PS)
//SYSIN    DD  DUMMY
