//TECN258A JOB NOTIFY=&SYSUID
//STEP1 EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN DD *
  PRINT -
  INDATASET(TECN258.TRAIN.DETAILS.AIX) -
  CHAR
/*
