//JCLEX03  JOB NOTIFY=&SYSUID
//STEP1    EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//INDD     DD DSN=JCLEX03.TEST.BCK.GDG1(0),DISP=OLD
//SYSIN    DD *
  PRINT INFILE(INDD) CHAR
/*
