//TECN258  JOB NOTIFY=&SYSUID
//STEP1    EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD * 
  PRINT -
  INDATASET(TECN258.PRODUCT.ESDS) -
  FROMADDRESS(80) -
  TOADDRESS(400) CHAR
/*
