//USERIDD JOB NOTIFY=&SYSUID
//STEP001 EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSOUT DD SYSOUT=*
//SYSIN DD *
    DELETE USERID.PAT.KSDS.CLUS PURGE
    IF LASTCC>0 THEN SET MAXCC=0
    DEFINE CLUSTER(NAME(USERID.PAT.KSDS.CLUS) -
    TRACKS(1,1) -
    CISZ(4096) -
    RECORDSIZE(80,80) -
    VOLUMES(VPWRKB) -
    INDEXED -
    FREESPACE(10,10)-
    KEYS(10,0))
/*
//STEP002 EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSOUT DD SYSOUT=*
//SYSIN DD *
   REPRO IDS(USERID.L0C.PAT.PS6) -
   ODS(USERID.PAT.KSDS.CLUS)
/*
//STEP003 EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSOUT DD SYSOUT=*
//SYSIN DD *
   DELETE USERID.PAT.KSDS.AIX PURGE
   IF LASTCC>0 THEN SET MAXCC=0
   DEFINE AIX(NAME(USERID.PAT.KSDS.AIX) -
   RELATE(USERID.PAT.KSDS.CLUS) -
   RECORDSIZE(80,80) -
   CISZ(4096) -
   TRACKS(1,1) -
   VOLUMES(VPWRKB) -
   NONUNIQUEKEY -
   KEYS(36,24) -
   FREESPACE(10,10))
/*
//STEP004 EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSOUT DD SYSOUT=*
//SYSIN DD *
   BLDINDEX IDS(USERID.PAT.KSDS.CLUS) -
   ODS(USERID.PAT.KSDS.AIX)
/*
//STEP005 EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSOUT DD SYSOUT=*
//SYSIN DD *
    DEFINE PATH(NAME(USERID.PAT.KSDS.AIX.PATH) -
    PATHENTRY(USERID.PAT.KSDS.AIX)
/*
//STEP006 EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSOUT DD SYSOUT=*
//SYSIN DD *
   DELETE USERID.PAT.KSDS.NEW PURGE
   IF LASTCC>0 THEN SET MAXCC=0
   ALTER USERID.PAT.KSDS.CLUS -
   NEWNAME(USERID.PAT.KSDS.NEW)
/*
