        IDENTIFICATION DIVISION.
        PROGRAM-ID. COBEX02.
        AUTHOR. MFDEVELOPER01.
        DATE-WRITTEN. 01/01/2020.
        DATE-COMPILED. 01/01/2020.
        ENVIRONMENT DIVISION.
        CONFIGURATION SECTION.
        SOURCE-COMPUTER. TEST-ZOS.
        OBJECT-COMPUTER. DEV-ZOS.
        DATA DIVISION.
        WORKING-STORAGE SECTION.
        77 WS-A PIC X(10).
        PROCEDURE DIVISION.
        000-PARA-MAIN.
                STOP RUN.
