//JCLEX02 JOB 'DEV',
//        CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1),NOTIFY=&SYSUID
//STEP1    EXEC PGM=IEFBR14
//SYSABEND DD SYSOUT=*
//DD1      DD DSN=JCLEX02.MYLIB.TEST.JCL1,
//            DISP=(NEW,CATLG,DELETE),
//            SPACE=(TRK,(1,1,1)),
//            DCB=(LRECL=80,RECFM=FB,BLKSIZE=800)
//STEP2    EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//DD1      DD DSN=JCLEX02.MYLIB.JCL3,DISP=SHR
//DD2      DD DSN=JCLEX02.TEST.JCL1,DISP=SHR
//SYSIN    DD *
    REPRO INFILE(DD1) OUTFILE(DD2)
/*
