//USER_ID  JOB 'DHAR',CLASS=A,
//         MSGCLASS=A,MSGLEVEL=(1,1),NOTIFY=&SYSUID
//STEP1    EXEC PGM=IEFBR14
//DDS      DD DSN=USER_ID.EMPDET.COPY.PS1,
//            DISP=(NEW,CATLG,DELETE),
//            SPACE=(TRK,(1,1)),
//            DCB=(DSORG=PS,RECFM=FB,LRECL=80)
//STEP2    EXEC PGM=IEBGENER
//SYSPRINT DD SYSOUT=*
//SYSUT1   DD DSN=USER_ID.EMPDET.PS3,
//            DISP=SHR
//SYSUT2   DD DSN=USER_ID.EMPDET.COPY.PS1,
//            DISP=OLD
//SYSIN    DD DUMMY
