        IDENTIFICATION DIVISION.
        PROGRAM-ID. CDBEX05.
        ENVIRONMENT DIVISION.
        INPUT-OUTPUT SECTION.
        FILE-CONTROL.
             SELECT TO001-OUTPUT ASSIGN TO OUTEMPPS
             ORGANIZATION IS SEQUENTIAL
             ACCESS MODE IS SEQUENTIAL
             FILE STATUS IS WS-FILE-STATUS1.
        DATA DIVISION.
        FILE SECTION.
        FD TO001-OUTPUT.
        01 TO001-OUTPUT-RECORD.
             05 TO001-EMP-NUM      PIC X(6).
             05 FILLER             PIC X.
             05 TO001-EMP-NAME     PIC X(40).
             05 FILLER             PIC X.
             05 TO001-WORK-DEPT    PIC X(3).
             05 FILLER             PIC X.
             05 TO001-JOB          PIC X(8).
             05 FILLER             PIC X.
             05 TO001-DOB          PIC X(10).
             05 FILLER             PIC X(9).
        WORKING-STORAGE SECTION.
        01 WS-G-FILE-STATUS.
             05 WS-FILE-STATUS1  PIC  X(2).
                88 WFS1-SUCCESS  VALUE  '00'.
                88 WFS1-EOF      VALUE  '10'.
            05 WS-ERR-MSG.
              10 WS-ERR-LEN        PIC  S9(4) COMP VALUE 800.
              10 WS-ERR-TEXT       PIC  X(80) OCCURS 10 TIMES.
            05 WS-ERR-LRECL        PIC  S9(4) COMP VALUE 80.
        01 WSS-SQLCODE             PIC  S9(3) SIGN LEADING SEPARATE.
            88 WS-EOT              VALUE  +100.
            88 WS-SUCCESS          VALUE  +000.
            EXEC SQL INCLUDE SQLCA END-EXEC.
            EXEC SQL INCLUDE EMPDCL END-EXEC.
            EXEC SQL
            DECLARE CS-TB-EMPLS CURSOR FOR
            SELECT EMPNO, FIRSTNAME, LASTNAME, WORKDEPT, JOB,
            DOB FROM GEN_EMPLOYEE
            ORDER BY EMPNO
            END-EXEC.
        01 WS-FIRST-NAME PIC X(20).
        01 WS-LAST-NAME  PIC X(20).
        PROCEDURE DIVISION.
        0000-MAIN-PARA.
                 PERFORM 1000-INITIALIZATION-PARA THRU
                 1000-INITIALIZATION-PARA-EXIT
                 PERFORM 2000-PROCESS-PARA THRU
                 2000-PROCESS-PARA-EXIT
                 PERFORM 9000-TERMINATION-PARA THRU
                 9000-TERMINATION-PARA-EXIT.
        0000-MAIN-PARA-EXIT.
                 EXIT.
        1000-INITIALIZATION-PARA.
        1000-INITIALIZATION-PARA-EXIT.
                 EXIT.
        2000-PROCESS-PARA.
                 PERFORM 2100-OPEN-PARA THRU
                 2100-OPEN-PARA-EXIT
                 PERFORM 2200-FETCH-PARA THRU
                 2200-FETCH-PARA-EXIT UNTIL WS-EOT
                 PERFORM 3000-CLOSE-PARA THRU
                 3000-CLOSE-PARA-EXIT.
        2000-PROCESS-PARA-EXIT.
                 EXIT.
        2100-OPEN-PARA.
                 EXEC SQL OPEN CS-TB-EMPLS END-EXEC.
                 MOVE SQLCODE TO WSS-SQLCODE
                 IF WS-SUCCESS
                 DISPLAY 'CURSOR OPEN SUCCESS' WSS-SQLCODE
                 OPEN OUTPUT TO001-OUTPUT
                 IF WFS1-SUCCESS
                  DISPLAY 'OUT1 FILE SUCCESS' WS-FILE-STATUS1
                  ELSE
                  DISPLAY 'OUT1 FILE UNSUCCESS' WS-FILE-STATUS1
                 END-IF
                 ELSE
                 DISPLAY 'CURSOR OPEN UNSUCCESS' WSS-SQLCODE
                 CALL 'DSNTIAR' USING SQLCA, WS-ERR-MSG WS-ERR-LRECL
                 DISPLAY WS-ERR-MSG
                 PERFORM 9000-TERMINATION-PARA THRU
                 9000-TERMINATION-PARA-EXIT
                 END-IF.
        2100-OPEN-PARA-EXIT.
                 EXIT.
        2200-FETCH-PARA.
                 EXEC SQL FETCH CS-TB-EMPLS INTO :EMPNO,
                 :FIRSTNAME, :LASTNAME, :WORKDEPT,
                 :JOB, :DOB
                 END-EXEC.
                 MOVE SQLCODE TO WSS-SQLCODE
                 EVALUATE TRUE
                 WHEN WS-SUCCESS
                 PERFORM 2300-MOVE-PARA THRU
                 2300-MOVE-PARA-EXIT
                 WHEN WS-EOT
                 CONTINUE
                 WHEN OTHER
                 DISPLAY 'CURSOR NOT FETCHED'
                 DISPLAY 'ERROR STATUS' SQLCODE
                 CALL 'DSNTIAR' USING SQLCA, WS-ERR-MSG WS-ERR-LRECL
                 DISPLAY WS-ERR-MSG
                 PERFORM 9000-TERMINATION-PARA THRU
                 9000-TERMINATION-PARA-EXIT
                 END-EVALUATE.
         2200-FETCH-PARA-EXIT.
                 EXIT.
         3000-CLOSE-PARA.
                 EXEC SQL CLOSE CS-TB-EMPLS END-EXEC.
                 MOVE SQLCODE TO WSS-SQLCODE
                 IF WS-SUCCESS
                 DISPLAY 'CURSOR CLOSED' WSS-SQLCODE
                 CLOSE TO001-OUTPUT
                 IF WFS1-SUCCESS
                  DISPLAY 'CLOSE FILE SUCCESS' WS-FILE-STATUS1
                  ELSE
                  DISPLAY 'CLOSE FILE UNSUCCESS' WS-FILE-STATUS1
                 END-IF
                 ELSE
                 DISPLAY 'CURSOR NOT CLOSED' WSS-SQLCODE
                 DISPLAY 'ERROR STATUS' SQLCODE
                 CALL 'DSNTIAR' USING SQLCA, WS-ERR-MSG WS-ERR-LRECL
                 DISPLAY WS-ERR-MSG
                 PERFORM 9000-TERMINATION-PARA THRU
                 9000-TERMINATION-PARA-EXIT
                 END-IF.
         3000-CLOSE-PARA-EXIT.
                 EXIT.
         2300-MOVE-PARA.
                 MOVE EMPNO TO TO001-EMP-NUM
                 MOVE FIRSTNAME-TEXT TO WS-FIRST-NAME
                 MOVE LASTNAME-TEXT TO WS-LAST-NAME
                 STRING WS-FIRST-NAME DELIMITED BY SPACE
                 WS-LAST-NAME DELIMITED BY SPACE
                 INTO TO001-EMP-NAME
                 END-STRING
                 MOVE WORKDEPT TO TO001-WORK-DEPT
                 MOVE JOB TO TO001-JOB
                 MOVE DOB TO TO001-DOB
                 WRITE TO001-OUTPUT-RECORD
                 IF WFS1-SUCCESS
                  DISPLAY 'WRITE FILE SUCCESS' WS-FILE-STATUS1
                  ELSE
                  DISPLAY 'WRITE FILE UNSUCCESS' WS-FILE-STATUS1
                 END-IF
                 MOVE SPACES TO EMPNO
                 MOVE SPACES TO FIRSTNAME
                 MOVE SPACES TO LASTNAME
                 MOVE SPACES TO WORKDEPT
                 MOVE SPACES TO JOB
                 MOVE SPACES TO DOB.
         2300-MOVE-PARA-EXIT.
                 EXIT.
         9000-TERMINATION-PARA.
                 STOP RUN.
         9000-TERMINATION-PARA-EXIT.
                 EXIT.
