//TECN252  JOB 'DHAR',CLASS=A,
//         MSGCLASS=A,MSGLEVEL=(1,1),NOTIFY=&SYSUID
//STEP1    EXEC PGM=IEBGENER
//SYSPRINT DD SYSOUT=*
//SYSUT1   DD  *
  WELCOME TO MAINFRAME
  IEBGENER UTILITY EXAMPLE
/*
//SYSUT2   DD DSN=TECN252.MYDATA.PS1,
//            DISP=(NEW,CATLG,DELETE),
//            SPACE=(TRK,(1,1)),
//            DCB=(RECFM=FB,LRECL=80,DSORG=PS)
//SYSIN    DD DUMMY
/*
