//JCLEX07  JOB (JCLEX07),'DIV',CLASS=A,
//         MSGCLASS=A,MSGLEVEL=(1,1),NOTIFY=&SYSUID
//STEP1    EXEC PGM=IEFBR14
//DD0      DD DSN=JCLEX07.MYDATA.PDS1,
//            DISP=(NEW,CATLG,DELETE),
//            SPACE=(TRK,(1,1,5)),
//            DCB=(LRECL=80,RECFM=FB,DSORG=PO)
