//USER_IDA JOB NOTIFY=&SYSUID
//STEP1 EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN DD *
   DEFINE CLUSTER(NAME(USER_ID.PRODUCT.ESDS) -
     TRACKS(2,2)  -
     CISZ(4096)       -
     FREESPACE(3,3)   -
     RECORDSIZE(80,80) -
     NONINDEXED)   -
     DATA(NAME(USER_ID.PRODUCT.ESDS.DATA))
/*
