  SORT FIELDS=COPY
  OUTFIL FILES=01,INCLUDE=(7,11,CH,EQ,C'CHN-CENTRAL',OR,
                           20,11,CH,EQ,C'CHN-CENTRAL')
  OUTFIL FILES=02,INCLUDE=(7,11,CH,EQ,C'CHN-EGMORE',OR,
                           20,11,CH,EQ,C'CHN-EGMORE')
