//USER_IDA JOB NOTIFY=&SYSUID
//STEP1 EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN DD *
  DEFINE AIX(NAME(USER_ID.PRODUCT.AIX) -
         RELATE(USER_ID.PRODUCT.ESDS) -
         CYLINDERS(10,10) -
         CISZ(4096) -
         KEYS(5,0) -
         RECORDSIZE(80,80) -
         FREESPACE(10,10) -
         UNIQUEKEY -
         VOLUME(ZAPRD4))
/*
