//TECN258S JOB NOTIFY=&SYSUID
//STEP1 EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN DD *
   REPRO -
   INDATASET(TECN258.PRODUCT.PS1) -
   OUTDATASET(TECN258.PRODUCT.ESDS)
/*
//STEP2 EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN DD *
   DELETE 'TECN258.PRODUCT.PS1'
/*
