//USER_IDS JOB NOTIFY=&SYSUID
//STEP1 EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN DD *
   REPRO -
   INDATASET(USER_ID.PRODUCT.PS1) -
   OUTDATASET(USER_ID.PRODUCT.ESDS)
/*
//STEP2 EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN DD *
   DELETE 'USER_ID.PRODUCT.PS1'
/*
