  SORT FIELDS=(1,5,CH,A)                                                00010000
  OMIT COND=(28,3,CH,EQ,C'ASV')                                         00020000
