   SORT FIELDS=COPY                                                     00010000
   OUTREC BUILD=(29,7,1X,1,6,1X,8,20,1X,37,9,80:X)                      00020003
