        IDENTIFICATION DIVISION.
        PROGRAM-ID. COBEX01.
        ENVIRONMENT DIVISION.
        CONFIGURATION SECTION.
        SPECIAL-NAMES.
            CLASS ALNUM 
            'A' THRU 'Z'
            'a' THRU 'z'
            '0' THRU '9'.
        DATA DIVISION.
        WORKING-STORAGE SECTION.
        01 WS-EMPLOYEE-DETAILS.
          05 EMPLOYEE-NAME        PIC A(20).
          05 EMPLOYEE-AGE         PIC 9(2).
          05 EMPLOYEE-SALARY      PIC 9(7)V99.
          05 EMPLOYEE-DESIGNATION PIC A(10).
          05 EMPLOYEE-DEPT-ID     PIC X(5).
        01 WS-EMPLOYEE-UPDATED-SALARY PIC S9(7)V99.
        01 WS-EMPLOYEE-SALARY     PIC Z(3)9(4).99.
        01 WS-EMPLOYEE-SALARY-PRINT PIC Z(2)9(5).99.
        PROCEDURE DIVISION.
        0000-MAIN-PARA.
            PERFORM 1000-INITIALIZE-PARA THRU 
                1000-INITIALIZE-PARA-EXIT.
            PERFORM 2000-PROCESS-PARA THRU 
                2000-PROCESS-PARA-EXIT.
            PERFORM 9000-TERMINATION-PARA THRU 
                9000-TERMINATION-PARA-EXIT.
        0000-MAIN-PARA-EXIT.
            EXIT.
        1000-INITIALIZE-PARA.
            INITIALIZE WS-EMPLOYEE-DETAILS.
        1000-INITIALIZE-PARA-EXIT.
            EXIT.
        2000-PROCESS-PARA.
            PERFORM EMPLOYEE-DETAILS-PARA THRU
                TAX-DEDUCTION-PARA.
        2000-PROCESS-PARA-EXIT.
            EXIT.
        9000-TERMINATION-PARA.
            STOP RUN.
        9000-TERMINATION-PARA-EXIT.
            EXIT.
        EMPLOYEE-DETAILS-PARA.
            ACCEPT EMPLOYEE-NAME.
            ACCEPT EMPLOYEE-AGE.
            ACCEPT EMPLOYEE-SALARY.
            ACCEPT EMPLOYEE-DESIGNATION.
            ACCEPT EMPLOYEE-DEPT-ID.
            EXIT.
        CHECK-EMPLOYEE-DETAILS-PARA.
            IF EMPLOYEE-NAME IS ALPHABETIC THEN
              DISPLAY "EMPLOYEE-NAME IS : " EMPLOYEE-NAME
            ELSE
              DISPLAY "EMPLOYEE-NAME IS INVALID"
            END-IF.
            EXIT.
        CHECK-EMPLOYEE-AGE-PARA.
            IF EMPLOYEE-AGE IS NUMERIC THEN
              DISPLAY "EMPLOYEE-AGE IS : " EMPLOYEE-AGE
            ELSE
              DISPLAY "EMPLOYEE-AGE IS INVALID"
            END-IF.
            EXIT.
        CHECK-EMPLOYEE-SALARY-PARA.
            MOVE EMPLOYEE-SALARY TO WS-EMPLOYEE-SALARY.
            IF EMPLOYEE-SALARY IS NUMERIC THEN
              DISPLAY "EMPLOYEE-SALARY IS : " WS-EMPLOYEE-SALARY
            ELSE
              DISPLAY "EMPLOYEE-SALARY IS INVALID"
            END-IF.
            EXIT.
        CHECK-EMPLOYEE-DESIGNATION-PAR.
            IF EMPLOYEE-DESIGNATION IS ALPHABETIC THEN
              DISPLAY "EMPLOYEE-DESIGNATION IS : " EMPLOYEE-DESIGNATION
            ELSE
              DISPLAY "EMPLOYEE-DESIGNATION IS INVALID"
            END-IF.
            EXIT.
        CHECK-EMPLOYEE-DEPTID-PARA.
            IF EMPLOYEE-DEPT-ID IS ALNUM THEN
              DISPLAY "EMPLOYEE-DEPTID IS : " EMPLOYEE-DEPT-ID
            ELSE
              DISPLAY "EMPLOYEE-DEPTID IS INVALID"
            END-IF.
            EXIT.
        TAX-DEDUCTION-PARA.
            COMPUTE WS-EMPLOYEE-UPDATED-SALARY = EMPLOYEE-SALARY - 35000.00.    
            MOVE WS-EMPLOYEE-UPDATED-SALARY TO 
                WS-EMPLOYEE-SALARY-PRINT.
            IF WS-EMPLOYEE-UPDATED-SALARY >= 0 THEN
              DISPLAY "TAX DEDUCTED FOR THE NEXT MONTH IS 0"
            ELSE
              DISPLAY "TAX DEDUCTED FOR THE NEXT MONTH IS : " 
                WS-EMPLOYEE-SALARY-PRINT
            END-IF.
            EXIT.
