//USER_IDR JOB NOTIFY=&SYSUID                   
//RUN EXEC PGM=COBEX01                          
//STEPLIB DD DSN=USER_ID.MYLIB.LOADLIB,DISP=SHR 
//SYSPRINT DD SYSOUT=*                          
//SYSIN DD *
ARUN KUMAR
35
25000.50
MANAGER
CS123
/*