//TECN258A  JOB NOTIFY=&SYSUID
//STEP1 EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//BACKUP   DD DSN=TECN258.PRODUCT.ESDS.BCKUP,DISP=SHR
//SYSIN    DD *                                        
     IMPORT                                 -
     INFILE(BACKUP)                         -
     OUTDATASET(TECN258.PRODUCT.ESDS) -
     INTOEMPTY
/*
