//CATSORT PROC
//STEP003 EXEC PGM=SORT
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SORTIN   DD DSN=TECN263.JCL.CC03.PS1,DISP=SHR
//SORTOUT  DD DSN=TECN263.JCL.CC03.PS2,DISP=SHR
//SYSIN    DD DSN=TECN263.JCL.CC03.PDS(MYCTL01),DISP=SHR
//        PEND
