//TECN258S JOB NOTIFY=&SYSUID
//STEP1 EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN DD *
   REPRO -
   INDATASET(TECN258.POLICY.PS1) -
   OUTDATASET(TECN258.POLICY.RRDS)
/*
//STEP2 EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN DD *
   DELETE 'TECN258.POLICY.PS1'
/*
