//TECN252  JOB NOTIFY=&SYSUID
//STEP1    EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  ALTER -
  TECN252.TEST.BCK.GDG1 -
  LIMIT(3)
/*
