//USER_IDS JOB NOTIFY=&SYSUID
//STEP1 EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN DD *
   DEFINE CLUSTER(NAME(USER_ID.POLICY.RRDS) -
     TRACKS(10,10)  -
     CISZ(4096)       -
     FREESPACE(10,10)   -
     RECORDSIZE(80,80) -
     NUMBERED) -
     DATA(NAME(TECN259.POLICY.RRDS.DATA))
/*
