//TECN258S JOB NOTIFY=&SYSUID
//STEP1 EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN DD *
   REPRO -
   INDATASET(TECN258.TRAIN.DETAILS.PS1) -
   OUTDATASET(TECN258.TRAIN.DETAILS.KSDS)
/*
//STEP2 EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN DD *
   DELETE 'TECN258.TRAIN.DETAILS.PS1'
/*
