//TECN258  JOB 'DHARMA',NOTIFY=&SYSUID
//STEP1    EXEC PGM=SORT
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SORTIN   DD DSN=TECN258.EMPREC.CS.PS1,DISP=SHR
//         DD DSN=TECN258.EMPREC.IT.PS1,DISP=SHR
//SORTOUT  DD DSN=TECN258.MERGE.PS1,
//            DISP=(MOD,CATLG,DELETE),
//            LIKE=TECN258.EMPREC.PS1
//SYSIN    DD *
  SORT FIELDS=(1,6,CH,A),EQUALS
/*
