//USER_ID  JOB NOTIFY=&SYSUID
//STEP1    EXEC PGM=SORT
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SORTIN   DD DSN=USER_ID.EMPREC.CS.PS1,DISP=SHR
//         DD DSN=USER_ID.EMPREC.IT.PS1,DISP=SHR
//SORTOUT  DD DSN=USER_ID.MERGE.PS1,
//            DISP=(MOD,CATLG,DELETE),
//            LIKE=USER_ID.EMPREC.PS1
//SYSIN    DD *
  SORT FIELDS=(1,6,CH,A),EQUALS
/*
