        IDENTIFICATION DIVISION.
        PROGRAM-ID. COBEX02.
        DATA DIVISION.
        WORKING-STORAGE SECTION.
        01 INPUT-NUMBER  PIC 9(3).
        01 OUTPUT-NUMBER PIC 9(3).
        01 REM  PIC 9.
        PROCEDURE DIVISION.
        0000-MAIN-PARA.
            PERFORM 1000-INITIALIZE-PARA THRU 9000-TERMINATION-PARA.
        0000-MAIN-PARA-EXIT.
            EXIT.
        1000-INITIALIZE-PARA.
            INITIALIZE INPUT-NUMBER.
        1000-INITIALIZE-PARA-EXIT.
            EXIT.
        2000-PROCESS-PARA.
            MOVE 756 TO INPUT-NUMBER.
            DISPLAY "INPUT NUMBER IS : " INPUT-NUMBER.
            PERFORM REV-FUNC-PARA UNTIL INPUT-NUMBER <= 0.
            DISPLAY "REVERSED NUMBER IS : " OUTPUT-NUMBER.
        2000-PROCESS-PARA-EXIT.
            EXIT.
        9000-TERMINATION-PARA.
            STOP RUN.
        9000-TERMINATION-PARA-EXIT.
            EXIT.
        REV-FUNC-PARA.
            DIVIDE INPUT-NUMBER BY 10 GIVING INPUT-NUMBER REMAINDER REM.
            COMPUTE OUTPUT-NUMBER = (OUTPUT-NUMBER * 10 ) + REM.
        REV-FUNC-PARA-EXIT.
            EXIT.
