  SORT FIELDS=(7,20,CH,A)                                               00010000
  OUTREC BUILD=(C'P',1,45,80:X)                                         00020000
