  SORT FIELDS=COPY                                                      00010000
  OUTREC OVERLAY=(4:C'#',47:37,5,ZD,ADD,+1000,TO=ZD,LENGTH=5,52:42,3)   00020006
