//JCLEX04  JOB (JCLEX04),NOTIFY=&SYSUID
//STEP1    EXEC PGM=IEBCOPY
//SYSPRINT DD SYSOUT=*
//DD0      DD DSN=JCLEX04.MYLIB.JCL1,
//            DISP=SHR
//DD1      DD DSN=JCLEX04.BACKUP.JCL1,
//            DISP=(NEW,CATLG,DELETE),
//            SPACE=(TRK,(5,5,5),RLSE),
//            DCB=(LRECL=80,RECFM=FB,DSORG=PO)
//SYSIN    DD *
  COPY INDD=DD0,OUTDD=DD1
  SELECT MEMBER=(JCLEX01,JCLEX03,JCLEX05,JCLEX07)
//*
