//JCLEX06  JOB (JCLEX06),'DEV',CLASS=A,
//         MSGCLASS=A,MSGLEVEL=(1,1),NOTIFY=&SYSUID
//STEP01   EXEC PGM=IEFBR14
//DD0      DD DSN=JCLEX06.MYDATA.PS1,
//            DISP=(NEW,CATLG,DELETE),
//            SPACE=(TRK,(1,1)),
//            DCB=(LRECL=80,RECFM=FB,DSORG=PS)
