//TECN258  JOB (TECN258),'DHARMA',NOTIFY=&SYSUID
//STEP1    EXEC PGM=IDCAMS
//SYSPRINT  DD   SYSOUT=*                                              
//SYSIN     DD   *                                                     
   SET MAXCC=4
/*
//STEP2    EXEC PGM=IEBGENER,COND=(4,LT,STEP1)
//SYSPRINT DD SYSOUT=*
//SYSUT1   DD *
    STEP2 EXECUTION IS SUCCESSFUL
/*
//SYSUT2   DD SYSOUT=*
//SYSIN    DD DUMMY
