//USER_ID  JOB 'DHARMA',NOTIFY=&SYSUID
//STEP1    EXEC PGM=SORT
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SORTIN   DD DSN=USER_ID.EMPREC.PS1,DISP=SHR
//SORTOUT  DD DSN=USER_ID.EMPREC.TOTAL.PS1,
//            DISP=(NEW,CATLG,DELETE),
//            LIKE=USER_ID.EMPREC.PS1
//SYSIN    DD *
  SORT FIELDS=(20,2,CH,A)
  SUM FIELDS=(23,6,ZD)
/*
