//USER_IDA JOB NOTIFY=&SYSUID,RESTART=STEP050
//*



//*  DEFINING A KSDS CLUSTER
//STEP010  EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  DELETE USER_ID.MISC.KSDS PURGE
  IF LASTCC>0 THEN SET MAXCC=0
  DEFINE CLUSTER(NAME(USER_ID.MISC.KSDS) -
         CISZ(4096) -
         VOLUMES(ZAPRD6) -
         FREESPACE(10,10) -
         TRACKS(5,5) -
         RECORDSIZE(80,80) -
         KEYS(2,0) -
         INDEXED)
/*
//* YOU CAN ALSO ADD DATA COMPONENT
//* FIRST TWO LINES -> PREDELETION OF CLUSTER -> USE IF NEEDED
//*






//* LOADING INTO KSDS
//* NORMALLY DONE AFTER CHECKING INPUT FILE IS EMPTY OR NOT
//STEP020  EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  REPRO -
  IDS(USER_ID.MISC.RDUPADD.PS5) -
  ODS(USER_ID.MISC.KSDS)
/*







//* PRINTING A KSDS
//* USE PRINT COMMAND, CAN ALSO USE FROMKEY, TOKEY TO FILTER
//STEP030  EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  PRINT -
  IDS(USER_ID.MISC.KSDS) -
  CHAR
/*
//*







//*  DEFINIG A ALTERNATE INDEX
//STEP040  EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  DEFINE AIX(NAME(USER_ID.MISC.KSDS.AIX) -
         RELATE(USER_ID.MISC.KSDS) -
         FREESPACE(10,10) -
         CISZ(4096) -
         VOLUMES(ZAPRD6) -
         TRACKS(5,5) -
         RECORDSIZE(80,80) -
         KEYS(4,3) -
         NONUNIQUEKEY
/*
//*







//*  BUILD INDEX
//STEP050  EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  BLDINDEX -
  IDS(USER_ID.MISC.KSDS) -
  ODS(USER_ID.MISC.KSDS.AIX)
/*
//*







//* DEFINING PATH
//STEP060  EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  DEFINE PATH(NAME(USER_ID.MISC.KSDSAIX) -
         PATHENTRY(USER_ID.MISC.KSDS.AIX))
/*
