//USER_IDA JOB NOTIFY=&SYSUID





//* DEFINING A RRDS CLUSTER
//STEP010  EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  DELETE USER_ID.MISC.RRDS PURGE
  IF LASTCC>0 THEN SET MAXCC=0
  DEFINE CLUSTER(NAME(USER_ID.MISC.RRDS) -
         CISZ(4096) -
         VOLUMES(ZAPRD6) -
         FREESPACE(10,10) -
         TRACKS(5,5) -
         RECORDSIZE(80,80) -
         NUMBERED)
/*
//*






//* LOADING INTO RRDS
//STEP020  EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  REPRO -
  IDS(USER_ID.MISC.RDUPADD.PS5) -
  ODS(USER_ID.MISC.RRDS)
/*
//*





//*  PRINTING RRDS, CAN USE FROMNUMBER, TONUMBER
//STEP030  EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  PRINT -
  IDS(USER_ID.MISC.RRDS) -
  CHAR
/*
