//USER_ID  JOB (USER_ID),'DH',CLASS=A,
//         MSGCLASS=A,MSGLEVEL=(1,1),NOTIFY=&SYSUID
//PLIB     JCLLIB ORDER=(USER_ID.MYPROC.JCL)
//*
//STEP1    EXEC DSCRT,NAME=USER_ID.SAMPLE.TEST.PSA
