//TECN258  JOB (TECN258),'DH',CLASS=A,
//         MSGCLASS=A,MSGLEVEL=(1,1),NOTIFY=&SYSUID
//PLIB     JCLLIB ORDER=(TECN258.MYPROC.JCL)
//*
//STEP1    EXEC DSCRT,NAME=TECN258.SAMPLE.TEST.PSA
