//JCLEX08 JOB (JCLEX08),'DIV',CLASS=A,
//        MSGCLASS=A,MSGLEVEL=(1,1),NOTIFY=&SYSUID
//STEP1   EXEC PGM=IEFBR14
//DD0     DD DSN=JCLEX08.MYDATA.PS2,
//           DISP=(NEW,CATLG,DELETE),
//           SPACE=(TRK,(1,1)),
//           DCB=(LRECL=80,RECFM=FB,DSORG=PS)
//STEP2   EXEC PGM=IEFBR14
//DD0     DD DSN=JCLEX08.MYDATA.PDS2,
//           DISP=(NEW,CATLG,DELETE),
//           SPACE=(TRK,(1,1,5)),
//           DCB=(LRECL=80,RECFM=FB,DSORG=PO)
