//TECN258  JOB NOTIFY=&SYSUID
//STEP1    EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  REPRO           -
  INDATASET(TECN258.EMPDET.PS1)    -
  OUTDATASET(TECN258.EMPLOY.DETAILS.PS2)  - 
  SKIP(4)         -
  COUNT(5)
/*
//STEP2   EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  PRINT INDATASET(TECN258.EMPLOY.DETAILS.PS2) -
  CHAR
/*
