//USER_ID  JOB NOTIFY=&SYSUID
//STEP1    EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  REPRO           -
  INDATASET(USER_ID.EMPDET.PS1)    -
  OUTDATASET(USER_ID.EMPLOY.DETAILS.PS2)  - 
  SKIP(4)         -
  COUNT(5)
/*
//STEP2   EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  PRINT INDATASET(USER_ID.EMPLOY.DETAILS.PS2) -
  CHAR
/*
