//TECN258  JOB NOTIFY=&SYSUID
//STEP1    EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD * 
  PRINT -
  INDATASET(TECN258.POLICY.RRDS) -
  FROMNUMBER(8) -
  TONUMBER(9) CHAR
/*
