//USER_ID  JOB NOTIFY=&SYSUID
//STEP1    EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD * 
  PRINT -
  INDATASET(USER_ID.POLICY.RRDS) -
  FROMNUMBER(8) -
  TONUMBER(9) CHAR
/*
