//TECN258E  JOB NOTIFY=&SYSUID
//STEP1 EXEC PGM=IDCAMS                      
//SYSPRINT DD SYSOUT=*                       
//SYSIN DD *                                 
    PRINT -                                   
    INDATASET(TECN258.TRAIN.DETAILS.KSDS) -   
    FROMKEY(10230) -                          
    TOKEY(25896) CHAR
/*
