//USER_IDA  JOB NOTIFY=&SYSUID
//STEP1 EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//BACKUP      DD DSN=USER_ID.TRAIN.DETAILS.KSDSBKP,
//            DISP=(NEW,CATLG,DELETE),
//            LIKE=USER_ID.TRAIN.DETAILS.KSDS
//SYSIN DD *
  EXPORT USER_ID.TRAIN.DETAILS.KSDS -
  OUTFILE(BACKUP) -
  PERMANENT
/*
//STEP2 EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN DD *
  DELETE 'USER_ID.TRAIN.DETAILS.KSDS'
/*
