        IDENTIFICATION DIVISION.
        PROGRAM-ID. COBEX04.
        DATA DIVISION.
        WORKING-STORAGE SECTION.
        01 INPUT-NUMBER  PIC 9(2).
        PROCEDURE DIVISION.
        0000-MAIN-PARA.
            PERFORM 1000-INITIALIZE-PARA THRU 9000-TERMINATION-PARA.
        0000-MAIN-PARA-EXIT.
            EXIT.
        1000-INITIALIZE-PARA.
            INITIALIZE INPUT-NUMBER.
        1000-INITIALIZE-PARA-EXIT.
            EXIT.
        2000-PROCESS-PARA.
            PERFORM EVAL-PARA THRU EVAL-PARA-EXIT.
        2000-PROCESS-PARA-EXIT.
            EXIT.
        9000-TERMINATION-PARA.
              STOP RUN.
        9000-TERMINATION-PARA-EXIT.
            EXIT.
        EVAL-PARA.
            ACCEPT INPUT-NUMBER.
            EVALUATE INPUT-NUMBER
              WHEN "28"
              WHEN "29"
                DISPLAY "POSSIBEL MONTHS WITH " INPUT-NUMBER " DAYS ARE"
                DISPLAY "FEB"
              WHEN "30"
                DISPLAY "POSSIBEL MONTHS WITH " INPUT-NUMBER " DAYS ARE"
                DISPLAY "APR/JUN/SEP/NOV"
              WHEN "31"
                DISPLAY "POSSIBEL MONTHS WITH " INPUT-NUMBER " DAYS ARE"
                DISPLAY "JAN/MAR/MAY/JUL/SEP/NOV"
              WHEN OTHER
                DISPLAY "Valid dates should be 28/29/30/31"
            END-EVALUATE.
        EVAL-PARA-EXIT.
            EXIT.
