        IDENTIFICATION DIVISION.
        PROGRAM-ID. DBEX08.
        DATA DIVISION.
        WORKING-STORAGE SECTION.
            EXEC SQL INCLUDE SQLCA END-EXEC.
            EXEC SQL INCLUDE DCLBANK END-EXEC.
        77 WS-CNT-ACCNO    PIC S9(04) USAGE COMP.
        PROCEDURE DIVISION.
        0000-MAIN-PARA.
                 PERFORM 1000-INITIALIZATION-PARA THRU
                 1000-INITIALIZATION-PARA-EXIT
                 PERFORM 2000-PROCESS-PARA THRU
                 2000-PROCESS-PARA-EXIT
                 PERFORM 9000-TERMINATION-PARA THRU
                 9000-TERMINATION-PARA-EXIT.
        0000-MAIN-PARA-EXIT.
                 EXIT.
        1000-INITIALIZATION-PARA.
        1000-INITIALIZATION-PARA-EXIT.
                 EXIT.
        2000-PROCESS-PARA.
                 PERFORM 2300-SELECT-PARA THRU
                 2300-SELECT-PARA-EXIT.
        2000-PROCESS-PARA-EXIT.
                 EXIT.
        2300-SELECT-PARA.
                 EXEC SQL
                 SELECT COUNT(ACCNO) INTO :WS-CNT-ACCNO
                 FROM BANKDET
                 END-EXEC.
                 PERFORM 2400-DISPLAY-PARA THRU
                 2400-DISPLAY-PARA-EXIT.
        2300-SELECT-PARA-EXIT.
                 EXIT.
        2400-DISPLAY-PARA.
             DISPLAY "TOTAL NUMBER OF ACCOUNT HOLDERS IN THE BANK IS: " 
             WS-CNT-ACCNO.
        2400-DISPLAY-PARA-EXIT.
                 EXIT.
        9000-TERMINATION-PARA.
                 STOP RUN.
        9000-TERMINATION-PARA-EXIT.
                 EXIT.
