   SORT FIELDS=COPY
   OUTREC IFTHEN=(WHEN=(14,5,CH,EQ,C'INFY',AND,7,2,ZD,GT,15),
   OVERLAY=(27:C'C1',30:C'H')),
   IFTHEN=(WHEN=(14,5,CH,EQ,C'ACC',AND,7,2,ZD,GT,15),
   OVERLAY=(27:C'C2',30:C'H')),
   IFTHEN=(WHEN=(14,5,CH,EQ,C'TCS',AND,7,2,ZD,GT,10),
   OVERLAY=(27:C'C3',30:C'M'))
