//TECN258   JOB 'DHARMA',NOTIFY=&SYSUID
//STEP1     EXEC PGM=SORT
//SYSPRINT  DD SYSOUT=*
//SYSOUT    DD SYSOUT=*
//SORTIN    DD DSN=TECN258.EMPREC.PS1,DISP=SHR
//SORTOUT   DD DSN=TECN258.EMPREC.ASIA.PS1,
//             DISP=(NEW,CATLG,DELETE),
//             LIKE=TECN258.EMPREC.PS1
//SYSIN     DD *
  SORT FIELDS=(1,6,CH,D)
  INCLUDE COND=(30,15,CH,EQ,C'INDIA',OR,
                30,15,CH,EQ,C'MALAYSIA',OR,
                30,15,CH,EQ,C'SINGAPORE')
/*
