//TECN252  JOB 'DHARMA',CLASS=A,
//         MSGCLASS=A,MSGLEVEL=(1,1),NOTIFY=&SYSUID
//STEP1    EXEC PGM=IEBCOMPR
//SYSPRINT DD SYSOUT=*
//SYSUT1   DD DSN=TECN252.EMPDET.COPY.PS1,DISP=SHR
//SYSUT2   DD DSN=TECN252.EMPDET.PS3,DISP=SHR
//SYSIN    DD *
   COMPARE TYPORG=PS
/*
