//USER_ID  JOB 'DHARMA',MSGLEVEL=(1,1),NOTIFY=&SYSUID
//STEP1    EXEC PGM=IEFBR14
//DD0      DD DSN=USER_ID.SAMP.TEST.PS1,
//            DISP=(NEW,CATLG,DELETE),
//            SPACE=(TRK,(1,1)),
//            DCB=(LRECL=80,RECFM=FB,DSORG=PS)
//STEP2    EXEC PGM=IEBGENER,COND=ONLY
//SYSPRINT DD SYSOUT=*
//SYSUT1   DD *
    THIS JOB IS TO TEST ABEND
/*
//SYSUT2   DD SYSOUT=*
//SYSIN    DD DUMMY
