//TECN258 JOB (DEV),'pardhu',CLASS=A,
//        MSGCLASS=A,MSGLEVEL=(1,1),NOTIFY=&SYSUID
//STEP1 EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN DD *
  DEFINE GDG(NAME(TECN258.TEST.BCK.GDG1) -
             LIMIT(5)                    -
             NOEMPTY                     -
             SCRATCH)
/
