        IDENTIFICATION DIVISION.
        PROGRAM-ID. COBEX03.
        DATA DIVISION.
        WORKING-STORAGE SECTION.
        01 WS-TRAIN-DETAILS.
            05 TRAIN-NUMBER       PIC 9(6).
            05 TRAIN-NAME         PIC X(20).
            05 TRAIN-TYPE         PIC X(2).
            05 DEPARTURE-STATION  PIC A(20).
            05 DEPARTURE-TIME     PIC X(5).
            05 ARRIVAL-STATION    PIC A(20).
            05 ARRIVAL-TIME       PIC X(5).
            05 FARE               PIC 9(4).
        01 WS-DEP-TIME  PIC 99. 
        01 WS-ARR-TIME  PIC 99.
        01 WS-JOURN-TIME  PIC 99.
        01 WS-TRAIN-FARE-SENIOR  PIC 9(3).
        PROCEDURE DIVISION.
        0000-MAIN-PARA.
        1000-INITIALIZE-PARA.
            MOVE 106510 TO TRAIN-NUMBER.
            MOVE 'KANYAKUMARI EXPRESS' TO TRAIN-NAME.
            MOVE 'SF' TO TRAIN-TYPE.
            MOVE 'KANYAKUMARI' TO DEPARTURE-STATION.
            MOVE '10:00' TO DEPARTURE-TIME.
            MOVE 'NEW DELHI' TO ARRIVAL-STATION.
            MOVE '20:00' TO ARRIVAL-TIME.
            MOVE 500 TO FARE.
        2000-PROCESS-PARA.
            MOVE DEPARTURE-TIME(1:2) TO WS-DEP-TIME.
            MOVE ARRIVAL-TIME(1:2) TO WS-ARR-TIME.
            SUBTRACT WS-DEP-TIME FROM WS-ARR-TIME GIVING WS-JOURN-TIME.
            COMPUTE WS-TRAIN-FARE-SENIOR = FARE - ( ( FARE / 100 ) * 5).
            DISPLAY "JOURNEY DURATION FROM KANYAKUMARI TO NEW-DELHI IS:"
            WS-JOURN-TIME ':00 HRS'.
            DISPLAY "FARE FOR SENIOR CITIZEN (KANYAKUMARI EXPRESS) IS: " 
            WS-TRAIN-FARE-SENIOR.
        9000-TERMINATION-PARA.
            STOP RUN.
