//JCLEX13  JOB (JCLEX13),'DEV',CLASS=A,
//         MSGCLASS=A,MSGLEVEL=(1,1),NOTIFY=&SYSUID
//STEP1    EXEC PGM=IEFBR14
//DD0      DD DSN=JCLEX13.TEST.PS,
//            DISP=(OLD,CATLG,DELETE),
//            SPACE=(TRK,(3,3))
