//TECN258  JOB NOTIFY=&SYSUID
//STEP1    EXEC PGM=IEFBR14
//DD1      DD  DSN=TECN258.TEST.BCK.GDG1(0),
//             DISP=(OLD,DELETE,DELETE)
//IFSTEP   IF RC=0 THEN
//STEP2    EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  DELETE TECN258.TEST.BCK.GDG1
/*
//ELSESTEP ELSE
//ENDSTEP ENDIF
