//JCLEX09  JOB (JCLEX09),'DIV',CLASS=A,
//         MSGCLASS=A,MSGLEVEL=(1,1),NOTIFY=&SYSUID
//STEP1    EXEC PGM=IEFBR14
//DD0      DD DSN=JCLEX09.MYDATA.PS2,
//            DISP=(OLD,DELETE)
