//USER_ID  JOB NOTIFY=&SYSUID
//STEP1    EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//INDD     DD DSN=USER_ID.EMPDET.PS1,DISP=SHR
//OUTDD    DD DSN=USER_ID.TEST.BCK.GDG1(+1),
//            DISP=(NEW,CATLG,DELETE),
//            SPACE=(TRK,(1,1)),
//            DCB=(RECFM=FB,LRECL=130,BLKSIZE=1300,DSORG=PS)
//SYSIN    DD *
  REPRO INFILE(INDD),OUTFILE(OUTDD)
/*
