//TECN258A JOB NOTIFY=&SYSUID
//STEP1 EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN DD *
  DEFINE PATH(NAME(TECN258.PRODUCT.DETAILS.EKSDSAIX) -
         PATHENTRY(TECN258.PRODUCT.AIX) -
         UPDATE
/*
