//USER_IDA JOB NOTIFY=&SYSUID
//STEP1 EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN DD *
  DEFINE PATH(NAME(USER_ID.PRODUCT.DETAILS.EKSDSAIX) -
         PATHENTRY(USER_ID.PRODUCT.AIX) -
         UPDATE
/*
