//TECN258A  JOB NOTIFY=&SYSUID
//STEP1 EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN DD *
  ALTER TECN258.TRAIN.DETAILS.KSDS.DATA  -
    FREESPACE(12 12))
/*
