//USER_IDA  JOB NOTIFY=&SYSUID
//STEP1 EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN DD *
  ALTER USER_ID.TRAIN.DETAILS.KSDS.DATA  -
    FREESPACE(12 12))
/*
