//USER_IDR JOB NOTIFY=&SYSUID                                           00010002
//RUN EXEC PGM=COBEX04                                                  00040024
//STEPLIB DD DSN=USER_ID.COBOL.LOADLIB,DISP=SHR                         00050002
//SYSPRINT DD SYSOUT=*                                                  00060000
//SYSIN DD DUMMY                                                        00100024
