        IDENTIFICATION DIVISION.
        PROGRAM-ID. DBEX01.
        DATA DIVISION.
        WORKING-STORAGE SECTION.
             EXEC SQL INCLUDE SQLCA END-EXEC.
        PROCEDURE DIVISION.
        0000-MAIN-PARA.
                 PERFORM 1000-INITIALIZATION-PARA THRU
                 1000-INITIALIZATION-PARA-EXIT
                 PERFORM 2000-PROCESS-PARA THRU
                 2000-PROCESS-PARA-EXIT
                 PERFORM 9000-TERMINATION-PARA THRU
                 9000-TERMINATION-PARA-EXIT.
        0000-MAIN-PARA-EXIT.
                 EXIT.
        1000-INITIALIZATION-PARA.
                 DISPLAY 'INITIALIZATION PARA'.
        1000-INITIALIZATION-PARA-EXIT.
                 EXIT.
        2000-PROCESS-PARA.
                 PERFORM 2100-CREATE-PARA THRU
                 2100-CREATE-PARA-EXIT.
        2000-PROCESS-PARA-EXIT.
                 EXIT.
        2100-CREATE-PARA.
                 EXEC SQL CREATE TABLE BANKDET (ACCNO INT,
                 ACCNAME VARCHAR(20),ACCTYP CHAR(7),
                 ACCAMT DECIMAL(8,2)) END-EXEC.
				 DISPLAY SQLCODE.
        2100-CREATE-PARA-EXIT.
                 EXIT.
        9000-TERMINATION-PARA.
                 STOP RUN.
        9000-TERMINATION-PARA-EXIT.
                 EXIT.
