        IDENTIFICATION DIVISION.
        PROGRAM-ID. COBEX05.
        ENVIRONMENT DIVISION.
        DATA DIVISION.
        WORKING-STORAGE SECTION.
        01 WS-PASSENGER-DETAILS.
            05 WS-PASSENGER-NAME PIC A(20).
            05 WS-AADHAR-NUMBER  PIC X(12).
            05 WS-DOB            PIC 9(8).
            05 WS-TRAIN-FARE     PIC 9(5)V9(2).
        01 WS-PASSENGER-DETAILS-PRINT.
            05 WS-PASSENGER-NAME-PRINT    PIC A(20).
            05 WS-AGE-PRINT               PIC 9(2).
            05 WS-AADHAR-NUMBER-PRINT     PIC X(4)/X(4)/X(4).
            05 WS-TRAIN-FARE-PRINT        PIC Z(4)9.
            05 WS-DOB-PRINT               PIC 9(2)/9(2)/9(4).
            05 WS-TRAIN-FARE-DOLLARS-PRINT PIC $9(3).
        01 T PIC 9 VALUE ZEROES.
        01 WS-POINTER PIC 99 VALUE 03.
        PROCEDURE DIVISION.
        0000-MAIN-PARA.
            PERFORM 1000-INITIALIZE-PARA THRU 1000-INITIALIZE-PARA-EXIT.
            PERFORM 2000-PROCESS-PARA THRU 2000-PROCESS-PARA-EXIT.
            PERFORM 9000-TERMINATION-PARA THRU 
            9000-TERMINATION-PARA-EXIT.
            STOP RUN.
        0000-MAIN-PARA-EXIT.
            EXIT.
        1000-INITIALIZE-PARA.
            INITIALIZE WS-PASSENGER-DETAILS-PRINT.
        1000-INITIALIZE-PARA-EXIT.
            EXIT.
        2000-PROCESS-PARA.
            MOVE "RAHUL KANNAM" TO WS-PASSENGER-NAME.
            MOVE "750012342345" TO WS-AADHAR-NUMBER.
            MOVE 20101990 TO WS-DOB.
            MOVE 0780 TO WS-TRAIN-FARE.
            MOVE WS-AADHAR-NUMBER TO WS-AADHAR-NUMBER-PRINT.
            MOVE WS-DOB TO WS-DOB-PRINT.
            MOVE 32 TO WS-AGE-PRINT.
            INSPECT WS-PASSENGER-NAME
            TALLYING T FOR CHARACTERS BEFORE INITIAL SPACE.
            STRING 
                  WS-PASSENGER-NAME DELIMITED BY " "
            INTO  WS-PASSENGER-NAME-PRINT
            WITH POINTER WS-POINTER.
            ADD 2 TO T.
            MOVE WS-PASSENGER-NAME(T:1) TO WS-PASSENGER-NAME-PRINT(1:1)
            MOVE "." TO WS-PASSENGER-NAME-PRINT(2:1).
            MOVE WS-TRAIN-FARE TO WS-TRAIN-FARE-PRINT.
            COMPUTE WS-TRAIN-FARE-DOLLARS-PRINT 
            ROUNDED = ( WS-TRAIN-FARE / 76 ).
            DISPLAY "PASSENGER NAME : " WS-PASSENGER-NAME-PRINT.
            DISPLAY "PASSENGER AGE  : " WS-AGE-PRINT.
            DISPLAY "PASSENGER DOB  : " WS-DOB-PRINT.
            DISPLAY "PASSENGER AADHAR NUMBER : " WS-AADHAR-NUMBER-PRINT.
            DISPLAY "TRAIN FARE     : " WS-TRAIN-FARE-DOLLARS-PRINT.
        2000-PROCESS-PARA-EXIT.
            EXIT.
        9000-TERMINATION-PARA.
        9000-TERMINATION-PARA-EXIT.
            EXIT.