//USER_IDA JOB NOTIFY=&SYSUID  
//RUN EXEC PGM=COBEX02                  
//STEPLIB DD DSN=USER_ID.MYLIB.LOADLIB,DISP=SHR  
//SYSPRINT DD SYSOUT=*      
//SYSIN DD *
075080085060055
/*
