//PSCOPY   PROC
//STEPD    EXEC PGM=IEBGENER
//SYSPRINT DD  SYSOUT=*
//SYSUT1   DD  DSN=&INP,DISP=SHR
//SYSUT2   DD  DSN=&OUT,DISP=OLD
//SYSIN    DD  DUMMY
