//TEKUSR0A JOB 001,CLASS=A,MSGLEVEL=(1,1),NOTIFY=&SYSUID              
//STEP1    EXEC PGM=IEFBR14
//SYSABEND  DD SYSOUT=A
//DD1      DD DSN=TEKUSR0.SAMPL.PS,DISP=(NEW,CATLG,DELETE),            
//         SPACE=(TRK,(1,1)),DCB=(LRECL=80,RECFM=FB,BLKSIZE=800)    
