//TECN180A JOB NOTIFY=&SYSUID
//STEP EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN DD *
   REPRO-
   INDATASET(TECN180.EMPDET.PS1)-
   OUTDATASET(TECN180.EMPLOY.DETAILS.PS1)-
   COUNT(3)
/*
