//USER_IDA JOB NOTIFY=&SYSUID
//STEP EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN DD *
   REPRO-
   INDATASET(USER_ID.EMPDET.PS1)-
   OUTDATASET(USER_ID.EMPLOY.DETAILS.PS1)-
   COUNT(3)
/*
